Tekla.Structures.ModelInternal.PourBreak
The PourBreak class represents a pour break in a model.

Tekla.Structures.ModelInternal.PourBreak.Insert
Inserts a new pour break. The geometry of the pour break
needs to be inserted in the constructor or by using the public ArrayList PolygonArray
function, before calling insert.
Returns: True on success.

Tekla.Structures.ModelInternal.PourBreak.Select
Selects the pour break instance from the model. The identifier of the instance
must be set.
Returns: True on success.

Tekla.Structures.ModelInternal.PourBreak.Modify
Modifies the existing pour break in the model database to match the current one.
Returns: True on success.

Tekla.Structures.ModelInternal.PourBreak.Delete
Deletes the pour break from the model database.
Returns: True on success.

Tekla.Structures.ModelInternal.PourBreak.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.PourBreak.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.PourBreak.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.PourBreak.ToStruct(Tekla.Structures.ModelInternal.dotPourBreak_t@)
Method creates conversion data structure for converting .NET polymesh found in this pour break
to geometry polymesh. Only single polymesh can be converted (pour break contains only one polymesh)
@see http://b-pdwiki/wiki/File:Polymesh_conversion_data_structure.png
output:
The output parameter.

Tekla.Structures.ModelInternal.PourBreak.FromStruct(Tekla.Structures.ModelInternal.dotPourBreak_t@)
Method creates conversion data structure for converting geometry polymesh to .NET polymesh. Since polymesh
is "imported" to pour break, only single pour break polymesh can be converted
@see http://b-pdwiki/wiki/File:Polymesh_conversion_data_structure.png
input:
The input parameter.

Tekla.Structures.ModelInternal.PourBreak.Polymesh
Gets or sets the polymesh that form the pour break geometry.